[
    {
        "text": "“To the HR who ghosted me after 5 rounds…”\n\n> I stayed up till 2AM preparing for your final round.\nPractised my answers, wore my best shirt, smiled.\nYou never showed up. Never replied.\n\nBut guess what? I still got hired.\nNot by a better company -\nbut by one that respected my time and dignity.\n\nTo jobseekers: Rejection ≠ your worth.\n\nTo recruiters: Empathy is free.",
        "engagement": 0,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Recruitment",
            "Job Search"
        ]
    },
    {
        "text": "“Your job title is not your personality.”\n\n> I met someone who was a VP at a fintech startup.\nHe spoke with kindness.\nTook the metro.\nReplied to every junior’s doubt patiently.\n\nAnd I’ve met interns who acted like CEOs.\n\nHumility >>> Designation.\n\nDon’t be so busy climbing the ladder…\nThat you forget how to be a decent human being.",
        "engagement": 0,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Leadership",
            "Humility"
        ]
    },
    {
        "text": "“Why didn’t you just quit if it was so toxic?”\n\nLet me tell you why:\n\nBecause rent is real.\nBecause savings aren’t infinite.\nBecause interviews take time.\nBecause self-doubt is loud.\n\nWe don’t always stay in bad jobs because we want to.\nWe stay because we feel stuck.\n\nSo if someone finally gathers the courage to leave - don’t say “you should’ve done it sooner.”\n\nSay “I’m proud of you for choosing yourself.”\n\nThat decision isn’t easy. It’s brave.",
        "engagement": 0,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Self Care",
            "Career"
        ]
    },
    {
        "text": "My biggest dream was never to own a mansion.\nIt was to never look at my bank balance before helping someone.\n\nI’ve always believed that wealth isn’t measured by how much you keep.\nIt’s measured by how easily you can give without fear.\n\nSince childhood, I had one simple wish -\nIf someone ever came to me and said,\n\"I’m in trouble. I need help.\"\nI should be able to reach into my pocket and give -\nWithout overthinking, without calculating,\nJust… give.\n\nI never wanted billions in the bank.\nI wanted peace in my heart.\nTo be financially comfortable -\nTo eat what I crave, go where I dream,\nPay my bills on time, take care of my loved ones,\nAnd still have enough left to uplift someone who’s struggling.\n\nThat, to me, is true success.\nThat, to me, is living gracefully.\n\nNo noise. No luxury flaunted.\nJust a quiet kind of abundance -\nWhere my needs are met, my heart is full, and my hands are never empty when someone needs them.\n\nI don't want to live to impress.\nI want to live to impact - softly, but meaningfully.\n\nIf I can live a good life and help someone else breathe a little easier -\nI’ve already won.",
        "engagement": 0,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Success",
            "Giving"
        ]
    },
    {
        "text": "Wake up at 5 AM.\nRead 3 books a week.\nBuild a side hustle.\nLearn to code.\n\nNow repeat after me:\n\nI am not a machine.\n\nProductivity guilt is killing us slowly.\n\nYou don’t have to do everything.\nYou don’t have to earn rest.\n\nYou’re allowed to just exist.\nAnd that - is enough.",
        "engagement": 0,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Productivity",
            "Motivation"
        ]
    },
    {
        "text": "500+ people commented “Interested.”\n\nNot a single one got a reply.\n\nWhy?\n\nBecause that job post was fake.\n\nOn LinkedIn, people prey on jobseekers' desperation just for likes and reach.\n\nIf you're posting fake jobs for clout - you're part of the problem.\n\nAnd to everyone commenting “Interested” - your worth is more than a desperate comment.\n\nSay it with me:\nNo more begging. No more scams. No more silence.",
        "engagement": 0,
        "line_count": 9,
        "language": "English",
        "tags": [
            "LinkedIn",
            "Scams"
        ]
    },
    {
        "text": "Not everyone makes it by 25.\nNot everyone has their dream job.\nNot everyone can afford to quit and “find themselves.”\n\nAnd that’s okay.\n\nSome of us are late bloomers.\nWe grow slow.\nQuiet.\nUnnoticed.\n\nBut we still bloom.\n\nIf you’re healing, learning, surviving -\nyou’re already doing something amazing.\n\nDon’t rush.\nYou’re not behind.\nYou’re just building roots.",
        "engagement": 0,
        "line_count": 11,
        "language": "English",
        "tags": [
            "Self Improvement",
            "Motivation"
        ]
    },
    {
        "text": "Imagine if candidates behaved like recruiters:\n (aka if karma had a LinkedIn profile)\n\n– Didn’t show up for interviews and later said, “Oh sorry, I was evaluating other companies.”\n– Took your product idea, smiled, said “brilliant!”… then used it for their startup pitch.\n– Made you go through 6 calls, 3 decks, 2 follow-ups — and then replied:\n“Sorry, we’re moving forward with another company that’s a slightly better culture fit.”\n– Said they accepted the offer... then never joined. When you followed up, they replied:\n“Who dis?”\n– Told you they love your company, but want to see what else is out there first.\n– Sent you feedback after 3 months saying:\n“You’re doing great. Just not great enough for me.”\nAnd best of all?\n– Created a “Company Tracker Sheet” with your name in the rejected tab, just to feel something.\n\nIf candidates did all this,\nyou’d call them unprofessional, immature, unreliable.\nBut when recruiters do it?\n“It’s part of the process.”\n\nNo. It’s part of the problem.\n\nHiring shouldn’t feel like Tinder + trauma + unpaid internship all rolled into one.\nFix your process. Or don’t complain when good talent stops picking up your calls.",
        "engagement": 0,
        "line_count": 24,
        "language": "English",
        "tags": [
            "Recruitment"
        ]
    },
    {
        "text": "“Maine kanya vadh kar diya.”\nThese five words were spoken by a father…\nRight after he murdered his own daughter.\nA daughter who dreamed.\nWho built her career with her own hands.\nWho dared to live life on her terms.\n\nRadhika Yadav wasn’t just a national-level tennis player.\nShe was a young woman with ambition, talent, and independence.\nShe opened her own tennis academy. She earned money.\nAnd that - was the problem.\n\nHer father confessed:\n\n“Log kehte the main beti ke paiso pe jeeta hoon... unhone uski character par sawaal uthaye... usse bola academy band karo, par usne mana kar diya. Mera maan aur purush ki izzat chali gayi.”\n\nSo he waited for the right moment.\nHe sent his son to buy milk.\nThen took a gun…\nAnd shot his daughter four times.\n\nLet’s not sugarcoat this.\n\nThis was not just a murder.\nThis was a patriarch’s final act of control.\nThis was a bruised ego trying to reclaim power.\nThis was centuries of internalized misogyny pulling the trigger.\n\nA young woman’s success still brought shame to her own family.\n\nBecause she didn’t obey.\nBecause she earned.\nBecause she said no.\n\nWe do not need more coding bootcamps, fintech startups, or TED Talks until we address the mindset that sees a woman’s independence as an insult.\n\nYou can send your daughter to school, to college, abroad even -\nBut if you don’t fix the mindset that says “she’s still mine to control”,\n\nYou haven’t empowered her.\nYou’ve just educated a prisoner.\n\nTo every woman reading this:\nYou are not responsible for anyone’s ego.\nKeep shining. Keep building. Keep fighting.",
        "engagement": 0,
        "line_count": 34,
        "language": "Hinglish",
        "tags": [
            "Misogyny",
            "Patriarchy"
        ]
    },
    {
        "text": "I know I’ve been missing for a while.\nLife threw a double punch - COVID and typhoid - and trust me, it wasn’t easy.\n\nA few days in the hospital, followed by weeks of slow recovery - physically, mentally, emotionally.\n\nSometimes, you don’t just need rest.\nYou need to pause.\n\nHealth issues aside, life hasn’t been easy lately.\nChallenges - some expected, most not - came in waves.\n\nAnd no matter how strong you are, there are moments where everything feels just… too much.\n\nBreathe.\nAnd be kind to yourself.\n\nThat’s exactly what I’ve been doing.\nI took a break. Logged off. Focused on healing.\n\nAnd now, step by step - I’m finding my way back.\nNot rushing. Just rebuilding - slowly and mindfully.\n\nTo everyone who checked in: thank you.\nTo everyone else navigating tough times: I see you. Take your time. Healing isn’t a race.\n\nI’m recovering.\nSlowly. Gently. One day at a time.\n\nTrying to find my rhythm again - without burning myself out.\n\nIf you’re going through something right now - whether it’s physical, mental, emotional -\n\nPlease know: it’s okay to pause.\n - It’s okay to fall behind.\n - It’s okay to not be okay.\n\nYou owe no one an explanation for choosing your peace.\nI’m still in that space - of reflection, realignment, and rebuilding.\n\nI’m coming back - one little step at a time.",
        "engagement": 0,
        "line_count": 29,
        "language": "English",
        "tags": [
            "Self Care",
            "Mental Health"
        ]
    }
]